## Задание 1

In [6]:
import pandas as pd
rate = pd.read_csv('C:\\netology\\net2020\\pandas_advanced_2\\Python_13_join\\ml-latest-small\\ratings.csv')

In [202]:
rategrouped = (
        rate.groupby('userId')
        .agg(('count','max','min'))
        .rename(columns={'movieId': 'ratings_count'})
)

rategrouped.loc[rategrouped[('ratings_count','count')]>100,('life_time','life_time')] = rategrouped[('timestamp','max')] - rategrouped[('timestamp','min')]

rategrouped = (
    rategrouped.loc[~pd.isnull(rategrouped[('life_time','life_time')]),:]
    [[('life_time','life_time')]]
)

rategrouped.sort_values(('life_time','life_time'),ascending=False)

          life_time
          life_time
userId
380     515789661.0
547     501810535.0
427     476569256.0
15      471393496.0
624     457492507.0
...             ...
110          1148.0
217           981.0
316           916.0
609           848.0
536           206.0

[258 rows x 1 columns]

## Задание 2

In [196]:
rzd = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115],
        'rzd_revenue': [1093, 2810, 10283, 5774, 981]
    }
)
auto = pd.DataFrame(
    {
        'client_id': [113, 114, 115, 116, 117],
        'auto_revenue': [57483, 83, 912, 4834, 98]
    }
)
air = pd.DataFrame(
    {
        'client_id': [115, 116, 117, 118],
        'air_revenue': [81, 4, 13, 173]
    }
)
client_base = pd.DataFrame(
    {
        'client_id': [111, 112, 113, 114, 115, 116, 117, 118],
        'address': ['Комсомольская 4', 'Энтузиастов 8а', 'Левобережная 1а', 'Мира 14', 'ЗЖБИиДК 1', 
                    'Строителей 18', 'Панфиловская 33', 'Мастеркова 4']
    }
)

In [201]:
t1 = air.merge(auto,on='client_id',how='outer').merge(rzd,on='client_id',how='outer')
t2 = t1.merge(client_base,on='client_id',how='left')
t1
t2

   client_id  air_revenue  auto_revenue  rzd_revenue          address
0        115         81.0         912.0        981.0        ЗЖБИиДК 1
1        116          4.0        4834.0          NaN    Строителей 18
2        117         13.0          98.0          NaN  Панфиловская 33
3        118        173.0           NaN          NaN     Мастеркова 4
4        113          NaN       57483.0      10283.0  Левобережная 1а
5        114          NaN          83.0       5774.0          Мира 14
6        111          NaN           NaN       1093.0  Комсомольская 4
7        112          NaN           NaN       2810.0   Энтузиастов 8а

## Задание 3

In [ ]:
# ¯\_(ツ)_/¯